[
    {
        "id": 0,
        "urlname": "tester",
        "name": "Tester file",
        "date": "Today",
        "data": "# This is a test file\n\nI'm a test file!\n\n## Here's more!\n\n*blah blah blah*\n\na [link](www.google.com)\n\n### third level\n\n**Bold text**\n\nHere is `some code` inline; for example, use the `biggest.main` method.\n\nExtended code:\n```\nint x = 5;\nfor(int i = 0; i < 5; i++)\n    print(x);\nreally.really.really.really.really.really.really.really.really.really.really.really.really.really.really.really.long.to.see.scrooll\npublic static void main(String args[]) {\n    int x = 15;\n    int y = 10;\n    int z = x + y;\n    System.out.println(z);\n} \n```\nAnother code snippet:\n```c\nint main() {\n    printf(\"%d\\n\", 5);\n    return 0;\n} \n```\n\nA quote:\n> I am a quote.\n\nA block quote:\n> text\n> more text\n> wow. I really am a block quote\n\nsome lists:\n\n1. one\n2. two\n3. three\n\n- a\n    - next\n    - hex\n- b\n    - first\n        - second\n- c\n"
    },
    {
        "id": 1,
        "urlname": "dishes",
        "name": "Wash the Dishes",
        "date": "August 5th, 2025",
        "data": "# Wash the Dishes\n\nAfter living on my own in a different country for a few months,\nthe errands and chores of daily life started to set in.\nI worked a regular(ish) nine-to-five, with about a forty-minute commute back.\nIt was basically 6pm by the time I would return to my apartment.\nThen more work needed to be done: cook for myself.\nAnd then when I was done eating, there was always one final hurdle:\nwashing the dishes.\n\nIt's so easy to just leave the dishes for the next day.\nIt makes ending my day just a bit earlier, retaining *just* a bit more of my sanity.\nSure, it makes my life a bit harder tomorrow morning,\nand it leaves the apartment a bit dirtier,\nand a bit less nice to stay in,\nbut all of that is worth the trade-off.\n\nRight?\n\nEventually, after cooking for myself one night,\nwitnessing the dishes accumulate from both myself and my roommates, \nfeeling the pull to just sit down and go on my phone,\nI instead shook my head, buckled down,\nand went to work.\n\nI grabbed one dish, took the sponge, lathered the thing in soap, rinsed it, put it to the side.\n\nI grabbed the next plate, took the sponge, washed it, rinsed it, placed it to the side.\n\nGrab, wash, rinse, place.\n\nRepeat.\n\nIt became almost meditative, and it freed my mind to think a little bit.\nI started to think about doing the dishes, and why we do them,\nand more importantly,\nwhy I should do them now, instead of later.\n\nThere's more surface level reasons for doing the dishes.\nIt makes the apartment cleaner and the kitchen nicer to look at.\nLess grime in the air, fewer bugs around, that sort of deal.\n\nGrab, wash, rinse, place.\n\nThat may be the literal effect of washing the dishes, I realize,\nbut my thoughts did not end there.\nI started to wonder, why *really* do we do the dishes? Maybe I'm asking the wrong question.\nMaybe instead, *who* am I washing the dishes for?\n\nWashing the dishes makes it easier for my roommates. \nThey don't have to wash the dishes that are mine.\nPlus their next adventure in the kitchen will just be a bit simpler with clean dishes.\nGrab, wash, rinse, place.\nI know I've been incredibly frustrated by my roommates leaving dirty dishes overnight\nor from breakfast when I need to cook afterwards. This just makes their lives\na bit easier too.\n\nI'd be lying if I said I wasn't washing the dishes for myself, either.\nIt turns my experience in the kitchen from subtle disgust \nof the scattered salt on the counters and the cobbled-together pile of dinner remains\nto something I'm more proud of.\n\nIt gives me a sense of accomplishment in many ways:\nfrom the initial choice to overcome my inertia and start washing,\nto the satisfaction of finishing something and doing it well,\nto putting a nice cap to the day of work\nand making future relaxation just *that* much more comfortable.\n\nI want to re-emphasize that idea of *doing something well*.\nGrab, rinse, wash...but this placing was interrupted,\nas I realized that the plate I was fitting into the drying rack\nwas going up against another plate that wasn't clean at all,\nand somehow against all odds beat the allegations of being dirty\nand ended up behind enemy lines.\n\nI took the dish and placed it on top of the stack in the sink.\nWhat's worse than not doing the dishes is doing a half-ass job of it.\nIt's as if you didn't do the job at all.\n\nAt this point in my self-meditation,\nI started to think more about my motivations for washing the dishes.\nThe pride of doing something well is admirable, but it's self-centered.\nAnd doing this chore for my roommates isn't that much more noble,\nas I'm more remembering when I'm annoyed when *they* aren't doing the dishes.\n\nSo, what *should* my motivations be?\n\nGrab, wash, rinse, place.\n\nI started to think of why I would think to do the dishes at all,\nand my parents started to roll over in my head,\nconstant reminders to finish doing the dishes,\nnitpicks about wiping up the standing water around the sink,\npains at forgetting the pot of lukewarm pasta water sitting\non the stove behind me.\n\nI used to do the dishes because they told me to.\nIn a sense, I was doing the dishes for them.\n\nI've already listed lots of other reasons for doing the dishes already,\nbut that's no real reason why this motivation needs to go the way of the dodo.\nWashing the dishes to make someone else proud is noble,\nand honestly, it's the one that feeds back best into my own satisfaction\nat completing the task.\n\nI know not everyone is religious, but the natural conclusion of this \nwas to conclude that I should be doing the dishes for God,\nto make Him proud, as if He were coming over at that second.\n\n> I can't take full credit for this thought. That goes to my sister,\n> who's normally not one to take advice from,\n> but for once, she has a point here.\n\nIf that doesn't work for you, think of your parents, or a good friend,\nand out of love for them, do the dishes. Or make your bed. Or set the table.\nBut make sure to *do it well*; if you notice something more, something small,\nto do it better...do it.\n\nWith no more dishes to grab, I took some paper towels\nand mopped up the standing water that accumulated around the faucet of the sink.\nNo job's done until it's done.\nAnd then I walked to the couch, sat down, and could truly relax.\n\nAt least until tomorrow, with more dishes to do. But maybe it's not\nso bad to do anymore.\n"
    }
]