[
    {
      "id": 0,
      "name": "Fundamentals of Computing",
      "name_italian": "Fondamenti dell'informatica",
      "description": "This is an introductory programming and C course that introduces fundamental principles of computer science, from formulating a problem and analyzing it conceptually, to designing, implementing, and testing a program on a computer. The course went over C fundamentals up to and including pointers. Example projects from the class are a Conway's Game of Life simulator, a crossword puzzle generator, fractal designs, and a final project, for which I remade Tetris using X11 graphics. Click on the gif to download it yourself (I still play it from time to time)!",
      "description_italian": "Questo è un corso introduttivo sulla programmazione e su C che introduce i principi fondamentali dell'informatica, dalla formulazione di un problema all'analisi al disegno, implementazione, e collaudo su un computer. Il corso copre i fondamenti di C fino ad includere i pointer. Progetti di esempio sono un simulatore di Conway's Game of Life, un generatore di cruciverba, frattali, e un progetto finale per cui ho rifatto Tetris. Clicca sul gif per caricarlo (gioco ancora ogni tanto!).",
      "image": "tetris_game.gif",
      "link": "https://github.com/henryJ099123/tetrisClone"
    },
    {
      "id": 1,
      "name": "Systems Programming",
      "name_italian": "Programmazione dei sistemi",
      "description": "Through this class, I learned the ins and outs of regular expressions, the command line, and the shell, as well as some more technical uses of both Python and C. We worked with different data formats, such as JSON, YAML, and XML, and how to parse them. The class concluded with developing a client-server connection, where the client was an interactive C program that queried a Python server to parse a JSON file. The Python server sent the requests back CSV-formatted over a ZMQ socket.",
      "description_italian": "In questo corso, ho imparato i dettagli di espressioni regolari, la riga di comando e la shell, e inoltre degli usi tecnici sia di entrambi Python che C. Ho imparato diverse formatte di data come JSON, YAML e XML e come analissarli. Il corso è concluso con lo sviluppo di un sistema client-server dove il cliente era un programma interattivo C che fa una query al server Python per analizzare un file JSON. Il server ha inviato le richieste formatte come un CSV su un socket ZMQ."
    },
    {
      "id": 2,
      "name": "Abstract Algebra",
      "name_italian": "Algebra astratta",
      "description": "An introduction to groups, rings and fields. Topics include permutations, divisibility, modular arithmetic, cryptography, cyclic and dihedral groups, Lagrange's theorem, homomorphisms, ideals, integral domains, extension fields. My <a href=\"/finalProject.pdf\" target=\"_blank\">final paper</a> for the class was a research and discussion on Boolean algebras that culminated in a proof of isomorphism between Boolean algebras and the power set and between Boolean rings and the power set.",
      "description_italian": "Un'introduzzione ai gruppi, anelli e campi. Argomenti includono permutazioni, divisibilità, aritmetica modulare, crittografia, gruppi ciclici e diedrali, teorema di Lagrange, omomorfismi, ideale, dominio d'integrità, estensioni di campi. Il mio <a href=\"/finalProject.pdf\" target=\"_blank\">saggio finale</a> per il corso erea una ricerca e discussione su algebre di Boole che culminato in una dimostrazione dell'isomorfismo fra le algebra di Boole e l'insieme delle parti e fra gli anelli di Boole e l'insieme delle parti.",
      "embed": "https://drive.google.com/file/d/12lh-QFI0xYgoo7pAFhfDKFNCwTZmITbM/preview",
      "link": "/finalProject.pdf"
    },
    {
      "id": 3,
      "name": "Data Structures",
      "name_italian": "Strutture dati",
      "description": "Your classic data structures class. This was taught in both C and Python: in C, we implemented dynamic arrays, linked lists, sorting algorithms, hash maps, sets, stacks, and more, while in Python, we implemented doubly linked lists, trees, binary trees, self-rotating trees, heaps, graphs, and graph search algorithms. The class also covered some important algorithms and processes in-depth, such as BFS, DFS, Dijkstra's, Prim's, Kahn's, heapsort, merge sort, quicksort, and more."
    },
    {
      "id": 4,
      "name": "Theory of Computing",
      "name_italian":"Teoria del calcolo",
      "description": "Introduction to formal languages and automata, computability theory, and complexity theory with the goal of developing understanding of the power and limits of different computational models. Topics covered include: regular languages and finite automata; context-free grammars and pushdown automata; Turing machines; undecidable languages; the classes P and NP; NP completeness. For the class, designed in a group a nondeterministic finite automaton simulator to match strings, a regular expression matcher à la grep that uses said NFA simulator to efficiently match strings, a sed-like programming language, and a regex matcher with backreferences. We also proved the regex matcher with backreferences was NP-complete by reducing 3SAT to it.",
      "description_italian": "Introduzione ai linguaggi formali e automi, la teoria della computabilità, e la teoria della complessità con lo scopo di capire la potenza e i limiti dei modelli computazionali diversi. Argomenti includono i linguaggi regolari e automi a stati finiti,  "
    },
    {
      "id": 5,
      "name": "Passage to Italy",
      "description": "Passage to Italy is a fifth-semester Italian class centered around refining grammar and understanding Italian culture from the 11th century onward. It involves reading literature from ancient authors (e.g. Dante, Cavalcanti, Saint Francis of Assisi), analyzing art of the Renaissance and Baroque periods (e.g. Michelangelo, Raffaelo, Caravaggio), seeing changes in more recent authors and art movements (Leopardi, Primo Levi, futurism) and understanding Italian history to boot (reunification, Risorgimento). Check out my final paper on a comparison of Michelangelo's <i>Pietà</i>'s <a href=\"/le_pieta.pdf\" target=\"_blank\"<a>here</a>."
    }
  ]